package com.samul.javaсorelessons.lesson3;

//5. Дан прямоугольник, ширина которого в два раза меньше длины. Найти площадь прямоугольника

public class SelfStudyTask5 {

	public static void main(String[] args) {
		double length = 10;
		double s;
		
		s = length * (length/2);
		
		System.out.println("S = " + s);
		
	}

}
